app/controllers/snippets_controller.rb

SELECT COUNT(*) FROM "snippets"
---
  def index
    @snippets = Snippet.paginate(page: params[:page], per_page: 10)

SELECT  "snippets".* FROM "snippets" WHERE "snippets"."id" = ?  ORDER BY "snippets"."created_at" DESC LIMIT 1  [["id", 2]]
---
  def show
    @snippet = Snippet.find(params[:id])

INSERT INTO "snippets" ("snippet", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["snippet", "shit mate"], ["title", "ебать сосать"], ["created_at", "2016-03-26 21:01:20.600499"], ["updated_at", "2016-03-26 21:01:20.600499"]]
---
  def create
    @snippet = Snippet.new(snippet_params)
    if @snippet.save

SELECT  "snippets".* FROM "snippets" WHERE "snippets"."id" = ?  ORDER BY "snippets"."created_at" DESC LIMIT 1  [["id", 2]]
---
  def edit
    @snippet = Snippet.find(params[:id])

SELECT  "snippets".* FROM "snippets" WHERE "snippets"."id" = ?  ORDER BY "snippets"."created_at" DESC LIMIT 1  [["id", 2]]
UPDATE "snippets" SET "snippet" = ?, "title" = ?, "updated_at" = ? WHERE "snippets"."id" = ?
---
  def update
    @snippet = Snippet.find(params[:id])
    if @snippet.update_attributes(snippet_params)

DELETE FROM "snippets" WHERE "snippets"."id" = ?  [["id", 3]]
SELECT  "snippets".* FROM "snippets" WHERE "snippets"."id" = ?  ORDER BY "snippets"."created_at" DESC LIMIT 1  [["id", 2]]
---
  def destroy
    Snippet.find(params[:id]).destroy